
days = ['Понедельник','Вторник','Среда','Четверг','Пятница','Суббота']
wcs = ['C3:D8','C10:D15','C17:D22','C24:D29','C31:D36','C38:D43']
titles = [f'<b><i>1 пара (8:00 - 9:40)</i></b>',f'<b><i>2 пара (9:55 - 11:35)</i></b>',f'<b><i>3 пара (12:15 - 13:55)</i></b>',f'<b><i>4 пара (14:10 - 15:50)</i></b>',f'<b><i>5 пара (16:20 - 18:00)</i></b>',f'<b><i>6 пара (18:15 - 19:55)</i></b>']
titles_for_days = [f'<b>Расписание на <i>Понедельник</i>:</b>\n\n',f'<b>Расписание на <i>Вторник</i>:</b>\n\n',f'<b>Расписание на <i>Среду</i>:</b>\n\n',f'<b>Расписание на <i>Четверг</i>:</b>\n\n',f'<b>Расписание на <i>Пятницу</i>:</b>\n\n',f'<b>Расписание на <i>Субботу</i>:</b>\n\n']
days_cells = dict(zip(days,wcs));
days_titles = dict(zip(days,titles_for_days))