
groupList1s = ['ТК - 311','ТК - 312','ТК - 313','ТП - 311','ТП - 312','ВР - 311','РТ - 311','КС - 311','ПД - 311', 'ПД - 331'] #10
groupList2s = ['ТЭ - 211','ТЭ - 212','ПО - 211','ПО - 212','ТО - 211','ТО - 212','ИК - 211','РО - 211','РТ - 321','ТП - 321','ТК - 321','ПД - 321']#12
groupList3s = ['ТЭ - 111','ТЭ - 112','ПО - 111','ПО - 112','ТО - 111','ТО - 112','ИК - 111','РО - 111','ТР - 221','ТЭ - 221','ПО - 221','ПИ - 221']#12
groupList4s = ['ТЭ - 011','ТЭ - 012','ПО - 011','ПО - 012','РО - 011','ТР - 121','ТЭ - 121','ПО - 121']#8

groupLists = groupList1s + groupList2s + groupList3s + groupList4s

groupList1v = ['СИ - 391','АП - 391','МЦ - 391','ИП - 391']
groupList2v = ['СП - 291','ИТ - 291','МС - 291','ИП - 291','ПС - 341','ТЦ - 341','ОП - 341','СИ - 341']
groupList3v = ['МС - 191','ИТ - 191','СП - 191','СО - 241','СТ - 241','ИТ - 241','ПС - 241']
groupList4v = ['СП - 091','МС - 091','СО - 141','СТ - 141','СП - 141','ИТ - 141','ПС - 141']

groupListv = groupList1v + groupList2v + groupList3v + groupList4v

groupList = groupLists + groupListv